#ifndef __square__
#define __square__

//------------------------------------------------------------------------------
// square.h - содержит описание обычной квадратной матрицы.
//------------------------------------------------------------------------------

#include "matrix.h"

using std::ifstream;
using std::ofstream;

//------------------------------------------------------------------------------
// Обычная квадратная матрица.
struct square : matrix {
    // Элементы матрицы.
    double **array;
};

// Ввод квадратной матрицы.
void In (square &m, ifstream &ifStream);

// Случайный ввод квадратной матрицы.
void InRandom(square &m);

// Вывод квадратной матрицы.
void Out(square &m, ofstream &ofStream);

// Удаление квадратной матрицы.
void Clear(square &m);

// Подсчет среднего значения элементов квадратной матрицы.
double Average(square &m);

#endif