#ifndef __random__
#define __random__

//------------------------------------------------------------------------------
// random.h - содержит генератор случайных чисел в заданном диапазоне.
//------------------------------------------------------------------------------

#include <cstdlib>

//------------------------------------------------------------------------------
// Генерация случайных чисел с плавающей точкой.
inline double Random(double min, double max) {
    return min + (rand() * (max - min) / RAND_MAX);
}

//------------------------------------------------------------------------------
// Генерация случайных целых чисел.
inline int Random(int min, int max) {
    return min + rand() % (max - min);
}
#endif //__random__
